---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ShortCurveInSketchRoof
source: html/b66611c2-1c8a-2246-4732-1c63cbc2ee54.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ShortCurveInSketchRoof Property

The sketch contains an extremely short line.

## Syntax (C#)
```csharp
public static FailureDefinitionId ShortCurveInSketchRoof { get; }
```